Public Member Functions | Friends | List of all members
IFCAPI::PropertyListValue Class Referencefinal
IFC Data Access
Represents an IfcPropertyListValue. More...
#include <IFCProperty.hpp>
 Inheritance diagram for IFCAPI::PropertyListValue:
 Public Member Functions
std::vector< IFCAPI::Value >  | GetListValues () const
Get list of property value.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
 class  | Property
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
Represents an IfcPropertyListValue.
Since
Archicad 28